000100*ARQUIVO DE TESTE DO LEXER
000200 IDENTIFICATION DIVISION.                                         PROGRAMA
000300 PROGRAM-ID. MEU-PROGRAMA.                                        PROGRAMA
000400 DATA DIVISION.                                                   PROGRAMA
000500 01  REGISTRO.                                                    
000600     02 NOME PIC X(30).
000700 77  VALOR-1 PIC 9(04) VALUE +123.45.
000800 PROCEDURE DIVISION.
000900 INICIO SECTION.
001000     MOVE VALOR-1 TO NOME.
001100     IF VALOR-1
001200         DISPLAY "ESTA STRING FOI 
001300-        "QUEBRADA EM DUAS LINHAS."
001400     ELSE
001500         ACCEPT NOME(1)
001600     STOP RUN.